"use client"
import Link from "next/link";
import { supabase } from "@/lib/supabase";
import { useEffect } from "react";

export default function Index() {
  return (
    <div>
      <Link href="/blogs">ブログ</Link>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
      <p>スクロール用</p>
    </div>
  );
}
